-- MySQL dump 10.13  Distrib 5.7.17, for macos10.12 (x86_64)
--
-- Host: 127.0.0.1    Database: spider
-- ------------------------------------------------------
-- Server version	5.7.19

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `position_type`
--

DROP TABLE IF EXISTS `position_type`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `position_type` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `parent_id` int(11) DEFAULT NULL COMMENT '父id',
  `position_name` varchar(45) DEFAULT NULL COMMENT '职位名称',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=315 DEFAULT CHARSET=utf8 COMMENT='职位分类';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `position_type`
--

LOCK TABLES `position_type` WRITE;
/*!40000 ALTER TABLE `position_type` DISABLE KEYS */;
INSERT INTO `position_type` VALUES (1,0,'技术'),(2,0,'产品'),(3,0,'设计'),(4,0,'运营'),(5,0,'市场与销售'),(6,0,'职能'),(7,0,'金融'),(8,1,'后端开发'),(9,1,'移动开发'),(10,1,'前端开发'),(11,1,'人工智能'),(12,1,'测试'),(13,1,'运维'),(14,1,'DBA'),(15,1,'高端职位'),(16,1,'项目管理'),(17,1,'硬件开发'),(18,1,'企业软件'),(19,2,'产品经理'),(20,2,'产品设计师'),(21,2,'高端职位'),(22,3,'视觉设计'),(23,3,'交互设计'),(24,3,'用户研究'),(25,3,'高端职位'),(26,4,'运营'),(27,4,'编辑'),(28,4,'客服'),(29,4,'高端职位'),(30,5,'市场/营销'),(31,5,'公关'),(32,5,'销售'),(33,5,'供应链'),(34,5,'采购'),(35,5,'投资'),(36,5,'高端职位'),(37,6,'人力资源'),(38,6,'行政'),(39,6,'财务'),(40,6,'法务'),(41,6,'高端职位'),(42,7,'投融资'),(43,7,'风控'),(44,7,'审计税务'),(45,7,'高端职位'),(46,8,'Java'),(47,8,'C++'),(48,8,'PHP'),(49,8,'数据挖掘'),(50,8,'搜索算法'),(51,8,'精准推荐'),(52,8,'C'),(53,8,'C#'),(54,8,'全栈工程师'),(55,8,'.NET'),(56,8,'Hadoop'),(57,8,'Python'),(58,8,'Delphi'),(59,8,'VB'),(60,8,'Perl'),(61,8,'Ruby'),(62,8,'Node.js'),(63,8,'Go'),(64,8,'ASP'),(65,8,'Shell'),(66,9,'HTML5'),(67,9,'Android'),(68,9,'iOS'),(69,9,'WP'),(70,9,'移动开发其它'),(71,10,'web前端'),(72,10,'Flash'),(73,10,'html5'),(74,10,'JavaScript'),(75,10,'U3D'),(76,10,'COCOS2D-X'),(77,10,'前端开发其它'),(78,11,'深度学习'),(79,11,'机器学习'),(80,11,'图像处理'),(81,11,'图像识别'),(82,11,'语音识别'),(83,11,'机器视觉'),(84,11,'算法工程师'),(85,11,'自然语言处理'),(86,12,'测试工程师'),(87,12,'自动化测试'),(88,12,'功能测试'),(89,12,'性能测试'),(90,12,'测试开发'),(91,12,'游戏测试'),(92,12,'白盒测试'),(93,12,'灰盒测试'),(94,12,'黑盒测试'),(95,12,'手机测试'),(96,12,'硬件测试'),(97,12,'测试经理'),(98,12,'测试其它'),(99,13,'运维工程师'),(100,13,'运维开发工程师'),(101,13,'网络工程师'),(102,13,'系统工程师'),(103,13,'IT支持'),(104,13,'IDC'),(105,13,'CDN'),(106,13,'F5'),(107,13,'系统管理员'),(108,13,'病毒分析'),(109,13,'WEB安全'),(110,13,'网络安全'),(111,13,'系统安全'),(112,13,'运维经理'),(113,13,'运维其它'),(114,14,'MySQL'),(115,14,'SQLServer'),(116,14,'Oracle'),(117,14,'DB2'),(118,14,'MongoDB'),(119,14,'ETL'),(120,14,'Hive'),(121,14,'数据仓库'),(122,14,'DBA其它'),(123,15,'技术经理'),(124,15,'技术总监'),(125,15,'架构师'),(126,15,'CTO'),(127,15,'运维总监'),(128,15,'技术合伙人'),(129,15,'项目总监'),(130,15,'测试总监'),(131,15,'安全专家'),(132,15,'高端技术职位其它'),(133,16,'项目经理'),(134,16,'项目助理'),(135,17,'硬件'),(136,17,'嵌入式'),(137,17,'自动化'),(138,17,'单片机'),(139,17,'电路设计'),(140,17,'驱动开发'),(141,17,'系统集成'),(142,17,'FPGA开发'),(143,17,'DSP开发'),(144,17,'ARM开发'),(145,17,'PCB工艺'),(146,17,'模具设计'),(147,17,'材料工程师'),(148,17,'精益工程师'),(149,17,'射频工程师'),(150,17,'硬件开发其它'),(151,18,'实施工程师'),(152,18,'售前工程师'),(153,18,'售后工程师'),(154,18,'BI工程师'),(155,18,'企业软件其它'),(156,19,'产品经理'),(157,19,'网页产品经理'),(158,19,'移动产品经理'),(159,19,'产品助理'),(160,19,'数据产品经理'),(161,19,'电商产品经理'),(162,19,'游戏策划'),(163,19,'产品实习生'),(164,20,'网页产品设计师'),(165,20,'无线产品设计师'),(166,21,'产品部经理'),(167,21,'产品总监'),(168,21,'游戏制作人'),(169,22,'视觉设计师'),(170,22,'网页设计师'),(171,22,'Flash设计师'),(172,22,'APP设计师'),(173,22,'UI设计师'),(174,22,'平面设计师'),(175,22,'美术设计师（2D/3D）'),(176,22,'广告设计师'),(177,22,'多媒体设计师'),(178,22,'原画师'),(179,22,'游戏特效'),(180,22,'游戏界面设计师'),(181,22,'游戏场景'),(182,22,'游戏角色'),(183,23,'交互设计师'),(184,23,'无线交互设计师'),(185,23,'网页交互设计师'),(186,23,'硬件交互设计师'),(187,24,'数据分析师'),(188,24,'用户研究员'),(189,24,'游戏数值策划'),(190,25,'设计经理/主管'),(191,25,'设计总监'),(192,25,'视觉设计经理/主管'),(193,25,'视觉设计总监'),(194,25,'交互设计经理/主管'),(195,25,'交互设计总监'),(196,25,'用户研究经理/主管'),(197,25,'用户研究总监'),(198,26,'用户运营'),(199,26,'产品运营'),(200,26,'数据运营'),(201,26,'内容运营'),(202,26,'活动运营'),(203,26,'商家运营'),(204,26,'品类运营'),(205,26,'游戏运营'),(206,26,'网络推广'),(207,26,'运营专员'),(208,26,'网店运营'),(209,26,'新媒体运营'),(210,26,'海外运营'),(211,26,'运营经理'),(212,27,'副主编'),(213,27,'内容编辑'),(214,27,'文案策划'),(215,27,'记者'),(216,28,'售前咨询'),(217,28,'售后客服'),(218,28,'淘宝客服'),(219,28,'客服经理'),(220,29,'主编'),(221,29,'运营总监'),(222,29,'COO'),(223,29,'客服总监'),(224,30,'市场营销'),(225,30,'市场策划'),(226,30,'市场顾问'),(227,30,'市场推广'),(228,30,'SEO'),(229,30,'SEM'),(230,30,'商务渠道'),(231,30,'商业数据分析'),(232,30,'活动策划'),(233,30,'网络营销'),(234,30,'海外市场'),(235,30,'政府关系'),(236,31,'媒介经理'),(237,31,'广告协调'),(238,31,'品牌公关'),(239,32,'销售专员'),(240,32,'销售经理'),(241,32,'客户代表'),(242,32,'大客户代表'),(243,32,'BD经理'),(244,32,'商务渠道'),(245,32,'渠道销售'),(246,32,'代理商销售'),(247,32,'销售助理'),(248,32,'电话销售'),(249,32,'销售顾问'),(250,32,'商品经理'),(251,33,'物流'),(252,33,'仓储'),(253,34,'采购专员'),(254,34,'采购经理'),(255,34,'商品经理'),(256,35,'分析师'),(257,35,'投资顾问'),(258,35,'投资经理'),(259,36,'市场总监'),(260,36,'销售总监'),(261,36,'商务总监'),(262,36,'CMO'),(263,36,'公关总监'),(264,36,'采购总监'),(265,36,'投资总监'),(266,37,'人力资源'),(267,37,'培训经理'),(268,37,'HRBP'),(269,37,'人事/HR'),(270,37,'薪资福利经理'),(271,37,'绩效考核经理'),(272,37,'员工关系'),(273,38,'助理'),(274,38,'前台'),(275,38,'行政'),(276,38,'总助'),(277,38,'文秘'),(278,39,'会计'),(279,39,'出纳'),(280,39,'财务'),(281,39,'结算'),(282,39,'税务'),(283,39,'审计'),(284,39,'风控'),(285,40,'法务'),(286,40,'律师'),(287,40,'专利'),(288,41,'行政总监/经理'),(289,41,'财务总监/经理'),(290,41,'HRD/HRM'),(291,41,'CFO'),(292,41,'CEO'),(293,42,'投资经理'),(294,42,'分析师'),(295,42,'投资助理'),(296,42,'融资'),(297,42,'并购'),(298,42,'行业研究'),(299,42,'投资者关系'),(300,42,'资产管理'),(301,42,'理财顾问'),(302,42,'交易员'),(303,43,'风控'),(304,43,'资信评估'),(305,43,'合规稽查'),(306,44,'审计'),(307,44,'法务'),(308,44,'会计'),(309,44,'清算'),(310,45,'投资总监'),(311,45,'融资总监'),(312,45,'并购总监'),(313,45,'风控总监'),(314,NULL,'副总裁');
/*!40000 ALTER TABLE `position_type` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2018-01-22 16:52:37
