-- MySQL dump 10.13  Distrib 5.7.17, for macos10.12 (x86_64)
--
-- Host: 127.0.0.1    Database: spider
-- ------------------------------------------------------
-- Server version	5.7.19

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `city`
--

DROP TABLE IF EXISTS `city`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `city` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `parent_id` int(11) DEFAULT NULL,
  `city_name` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=426 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `city`
--

LOCK TABLES `city` WRITE;
/*!40000 ALTER TABLE `city` DISABLE KEYS */;
INSERT INTO `city` VALUES (1,0,'国内'),(2,0,'国外'),(3,1,'北京'),(4,1,'天津'),(5,1,'上海'),(6,1,'重庆'),(7,1,'广东'),(8,1,'湖北'),(9,1,'陕西'),(10,1,'四川'),(11,1,'辽宁'),(12,1,'吉林'),(13,1,'江苏'),(14,1,'山东'),(15,1,'浙江'),(16,1,'广西'),(17,1,'安徽'),(18,1,'河北'),(19,1,'山西'),(20,1,'内蒙'),(21,1,'黑龙江'),(22,1,'福建'),(23,1,'江西'),(24,1,'河南'),(25,1,'湖南'),(26,1,'海南'),(27,1,'贵州'),(28,1,'云南'),(29,1,'西藏'),(30,1,'甘肃'),(31,1,'青海'),(32,1,'宁夏'),(33,1,'新疆'),(34,1,'台湾'),(35,1,'香港'),(36,1,'澳门'),(37,7,'广州'),(38,7,'韶关'),(39,7,'深圳'),(40,7,'珠海'),(41,7,'汕头'),(42,7,'佛山'),(43,7,'江门'),(44,7,'湛江'),(45,7,'茂名'),(46,7,'肇庆'),(47,7,'惠州'),(48,7,'梅州'),(49,7,'汕尾'),(50,7,'河源'),(51,7,'阳江'),(52,7,'清远'),(53,7,'东莞'),(54,7,'中山'),(55,7,'潮州'),(56,7,'揭阳'),(57,7,'云浮'),(58,8,'武汉'),(59,8,'黄石'),(60,8,'十堰'),(61,8,'宜昌'),(62,8,'襄阳'),(63,8,'鄂州'),(64,8,'荆门'),(65,8,'孝感'),(66,8,'荆州'),(67,8,'黄冈'),(68,8,'咸宁'),(69,8,'随州'),(70,8,'恩施'),(71,8,'公安'),(72,8,'武穴'),(73,8,'天门'),(74,8,'仙桃'),(75,8,'潜江'),(76,8,'宜城'),(77,8,'神农架'),(78,9,'西安'),(79,9,'铜川'),(80,9,'宝鸡'),(81,9,'咸阳'),(82,9,'渭南'),(83,9,'延安'),(84,9,'汉中'),(85,9,'榆林'),(86,9,'安康'),(87,9,'商洛'),(88,9,'兴平'),(89,9,'杨凌'),(90,9,'西咸新区'),(91,10,'成都'),(92,10,'自贡'),(93,10,'攀枝花'),(94,10,'泸州'),(95,10,'德阳'),(96,10,'绵阳'),(97,10,'广元'),(98,10,'遂宁'),(99,10,'内江'),(100,10,'乐山'),(101,10,'南充'),(102,10,'眉山'),(103,10,'宜宾'),(104,10,'广安'),(105,10,'达州'),(106,10,'雅安'),(107,10,'巴中'),(108,10,'资阳'),(109,10,'阿坝'),(110,10,'甘孜'),(111,10,'凉山'),(112,10,'峨眉'),(113,10,'西昌'),(114,10,'简阳'),(115,11,'大连'),(116,11,'沈阳'),(117,11,'抚顺'),(118,11,'本溪'),(119,11,'绵州'),(120,11,'营口'),(121,11,'辽阳'),(122,11,'盘锦'),(123,11,'朝阳'),(124,11,'葫芦岛'),(125,11,'海城'),(126,11,'昌图'),(127,11,'东港'),(128,12,'长春'),(129,12,'珲春'),(130,12,'吉林市'),(131,12,'四平'),(132,12,'辽源'),(133,12,'通化'),(134,12,'白山'),(135,12,'松原'),(136,12,'白城'),(137,12,'延边'),(138,12,'公主岭'),(139,13,'南京'),(140,13,'苏州'),(141,13,'昆山'),(142,13,'常熟'),(143,13,'张家港'),(144,13,'无锡'),(145,13,'徐州'),(146,13,'常州'),(147,13,'南通'),(148,13,'连云港'),(149,13,'淮安'),(150,13,'盐城'),(151,13,'扬州'),(152,13,'镇江'),(153,13,'泰州'),(154,13,'宿迁'),(155,13,'太仓市'),(156,14,'济南'),(157,14,'青岛'),(158,14,'淄博'),(159,14,'枣庄'),(160,14,'东营'),(161,14,'烟台'),(162,14,'潍坊'),(163,14,'济宁'),(164,14,'泰安'),(165,14,'威海'),(166,14,'日照'),(167,14,'莱芜'),(168,14,'临沂'),(169,14,'德州'),(170,14,'聊城'),(171,14,'滨州'),(172,14,'菏泽'),(173,15,'杭州'),(174,15,'宁波'),(175,15,'温州'),(176,15,'嘉兴'),(177,15,'湖州'),(178,15,'绍兴'),(179,15,'金华'),(180,15,'衢州'),(181,15,'舟山'),(182,15,'台州'),(183,15,'丽水'),(184,15,'方家山'),(185,16,'南宁'),(186,16,'柳州'),(187,16,'桂林'),(188,16,'梧州'),(189,16,'北海'),(190,16,'防城港'),(191,16,'钦州'),(192,16,'贵港'),(193,16,'玉林'),(194,16,'百色'),(195,16,'贺州'),(196,16,'河池'),(197,16,'来宾'),(198,16,'崇左'),(199,17,'合肥'),(200,17,'芜湖'),(201,17,'蚌埠'),(202,17,'淮南'),(203,17,'马鞍山'),(204,17,'淮北'),(205,17,'铜陵'),(206,17,'安庆'),(207,17,'黄山'),(208,17,'滁州'),(209,17,'阜阳'),(210,17,'宿州'),(211,17,'六安'),(212,17,'亳州'),(213,17,'池州'),(214,17,'宣城'),(215,17,'凤阳'),(216,17,'广德'),(217,17,'宿松'),(218,18,'石家庄'),(219,18,'唐山'),(220,18,'秦皇岛'),(221,18,'邯郸'),(222,18,'邢台'),(223,18,'保定'),(224,18,'张家口'),(225,18,'承德'),(226,18,'沧州'),(227,18,'廊坊'),(228,18,'衡水'),(229,18,'遵化'),(230,19,'太原'),(231,19,'大同'),(232,19,'阳泉'),(233,19,'长治'),(234,19,'晋城'),(235,19,'朔州'),(236,19,'晋中'),(237,19,'运城'),(238,19,'忻州'),(239,19,'临汾'),(240,19,'吕梁'),(241,19,'永济市'),(242,20,'呼和浩特'),(243,20,'包头'),(244,20,'乌海'),(245,20,'赤峰'),(246,20,'通辽'),(247,20,'鄂尔多斯'),(248,20,'呼伦贝尔'),(249,20,'兴安盟'),(250,20,'锡林郭勒盟'),(251,20,'乌兰察布'),(252,20,'巴彦淖尔'),(253,20,'阿拉善盟'),(254,20,'乌审旗'),(255,20,'满洲里'),(256,21,'哈尔滨'),(257,21,'齐齐哈尔'),(258,21,'鸡西'),(259,21,'鹤岗'),(260,21,'双鸭山'),(261,21,'大庆'),(262,21,'伊春'),(263,21,'佳木斯'),(264,21,'七台河'),(265,21,'牡丹江'),(266,21,'黑河'),(267,21,'绥化'),(268,21,'大兴安岭'),(269,21,'安达'),(270,21,'双城'),(271,21,'尚志'),(272,21,'绥芬河'),(273,21,'肇东市'),(274,22,'福州'),(275,22,'厦门'),(276,22,'莆田'),(277,22,'三明'),(278,22,'泉州'),(279,22,'漳州'),(280,22,'南平'),(281,22,'龙岩'),(282,22,'宁德'),(283,23,'南昌'),(284,23,'景德镇'),(285,23,'萍乡'),(286,23,'九江'),(287,23,'新余'),(288,23,'鹰潭'),(289,23,'赣州'),(290,23,'吉安'),(291,23,'宜春'),(292,23,'抚州'),(293,23,'上饶'),(294,24,'郑州'),(295,24,'开封'),(296,24,'洛阳'),(297,24,'平顶山'),(298,24,'安阳'),(299,24,'鹤壁'),(300,24,'新乡'),(301,24,'焦作'),(302,24,'濮阳'),(303,24,'许昌'),(304,24,'漯河'),(305,24,'三门峡'),(306,24,'南阳'),(307,24,'商丘'),(308,24,'信阳'),(309,24,'周口'),(310,24,'驻马店'),(311,24,'济源'),(312,24,'西平'),(313,25,'长沙'),(314,25,'株洲'),(315,25,'湘潭'),(316,25,'衡阳'),(317,25,'邵阳'),(318,25,'岳阳'),(319,25,'常德'),(320,25,'张家界'),(321,25,'益阳'),(322,25,'郴州'),(323,25,'永州'),(324,25,'怀化'),(325,25,'娄底'),(326,25,'向西'),(327,26,'海口'),(328,26,'三亚'),(329,26,'洋浦市/洋浦经济开发区'),(330,26,'琼海'),(331,26,'儋州'),(332,26,'五指山'),(333,26,'文昌'),(334,26,'万宁'),(335,26,'东方'),(336,26,'定安'),(337,26,'屯昌'),(338,26,'澄迈'),(339,26,'临高'),(340,26,'琼中'),(341,26,'保亭'),(342,26,'白沙'),(343,26,'昌江'),(344,26,'乐东'),(345,26,'陵水'),(346,27,'贵阳'),(347,27,'六盘水'),(348,27,'遵义'),(349,27,'安顺'),(350,27,'铜仁'),(351,27,'黔西南'),(352,27,'毕节'),(353,27,'黔东南'),(354,27,'黔南'),(355,28,'昆明'),(356,28,'曲靖'),(357,28,'玉溪'),(358,28,'保山'),(359,28,'昭通'),(360,28,'楚雄'),(361,28,'红河'),(362,28,'文山'),(363,28,'西双版纳'),(364,28,'大理'),(365,28,'德宏'),(366,28,'丽江'),(367,28,'怒江'),(368,28,'迪庆'),(369,28,'临沧'),(370,28,'普洱'),(371,29,'拉萨'),(372,29,'昌都'),(373,29,'山南'),(374,29,'日喀则'),(375,29,'那曲'),(376,29,'阿里'),(377,29,'林芝'),(378,30,'兰州'),(379,30,'嘉峪关'),(380,30,'金昌'),(381,30,'白银'),(382,30,'天水'),(383,30,'武威'),(384,30,'张掖'),(385,30,'平凉'),(386,30,'酒泉'),(387,30,'庆阳'),(388,30,'定西'),(389,30,'陇南'),(390,30,'临夏'),(391,30,'甘南'),(392,31,'西宁'),(393,31,'海东'),(394,31,'海北'),(395,31,'黄南'),(396,31,'海南州'),(397,31,'果洛'),(398,31,'玉树'),(399,31,'海西'),(400,32,'银川'),(401,32,'石嘴山'),(402,32,'吴忠'),(403,32,'固原'),(404,32,'中卫'),(405,33,'乌鲁木齐'),(406,33,'克拉玛依'),(407,33,'吐鲁番'),(408,33,'哈密'),(409,33,'昌吉'),(410,33,'博尔塔拉'),(411,33,'巴音郭楞'),(412,33,'阿克苏'),(413,33,'克孜勒苏'),(414,33,'喀什'),(415,33,'和田'),(416,33,'伊犁'),(417,33,'塔城'),(418,33,'阿勒泰'),(419,33,'石河子'),(420,33,'奎屯市'),(421,33,'乌苏'),(422,33,'阿拉尔'),(423,33,'图木舒克'),(424,33,'五家渠'),(425,33,'北屯区');
/*!40000 ALTER TABLE `city` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `zhilian_company`
--

DROP TABLE IF EXISTS `zhilian_company`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `zhilian_company` (
  `company_md5` varchar(100) NOT NULL,
  `full_name` varchar(100) DEFAULT NULL COMMENT '公司全称',
  `size` varchar(45) DEFAULT NULL COMMENT '公司规模',
  `company_nature` varchar(45) DEFAULT NULL COMMENT '公司性质',
  `logo` varchar(255) DEFAULT NULL,
  `website` varchar(255) DEFAULT NULL COMMENT '公司网站',
  `industry` varchar(255) DEFAULT NULL COMMENT '公司行业',
  `address` varchar(255) DEFAULT NULL COMMENT '公司地址',
  `created_at` varchar(45) DEFAULT NULL,
  `company_url` varchar(255) DEFAULT NULL COMMENT '公司链接',
  PRIMARY KEY (`company_md5`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='智联招聘公司信息';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `zhilian_company`
--

LOCK TABLES `zhilian_company` WRITE;
/*!40000 ALTER TABLE `zhilian_company` DISABLE KEYS */;
/*!40000 ALTER TABLE `zhilian_company` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `zhilian_position`
--

DROP TABLE IF EXISTS `zhilian_position`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `zhilian_position` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `position_name` varchar(255) DEFAULT NULL COMMENT '职位名称',
  `city` varchar(45) DEFAULT NULL COMMENT '城市',
  `company_md5` varchar(100) DEFAULT NULL,
  `unique_md5` varchar(100) DEFAULT NULL COMMENT '职位表示，是 职位名称+公司名称+发布时间 组合而成的md5值',
  `salary_low` int(11) DEFAULT NULL COMMENT '薪资下限',
  `salary_high` int(11) DEFAULT NULL COMMENT '薪资上限',
  `location` varchar(500) DEFAULT NULL COMMENT '工作地址',
  `publish_time` varchar(45) DEFAULT NULL COMMENT '发布日期',
  `advantage_labels` varchar(45) DEFAULT NULL COMMENT '职位诱惑标签',
  `job_nature` varchar(45) DEFAULT NULL COMMENT '工作性质',
  `work_year` varchar(45) DEFAULT NULL,
  `education` varchar(45) DEFAULT NULL COMMENT '学历',
  `recruit_num` int(11) DEFAULT NULL,
  `position_type` varchar(45) DEFAULT NULL COMMENT '职位类别',
  `content` longtext,
  `created_at` int(11) DEFAULT NULL COMMENT '创建时间',
  `url` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `unique_md5_UNIQUE` (`unique_md5`),
  KEY `index_position_name` (`position_name`),
  KEY `index_city` (`city`),
  KEY `index_position_type` (`position_type`),
  FULLTEXT KEY `ft_position` (`position_name`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COMMENT='智联招聘职位表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `zhilian_position`
--

LOCK TABLES `zhilian_position` WRITE;
/*!40000 ALTER TABLE `zhilian_position` DISABLE KEYS */;
/*!40000 ALTER TABLE `zhilian_position` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2017-10-17 14:57:28
